DataParallel(
  (module): Net(
    (feat0): ConvBlock(
      (conv): Conv2d(3, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (act): PReLU(num_parameters=1)
    )
    (feat1): ConvBlock(
      (conv): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1))
      (act): PReLU(num_parameters=1)
    )
    (up1): UpBlock(
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down1): DownBlock(
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up2): UpBlock(
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down2): D_DownBlock(
      (conv): ConvBlock(
        (conv): Conv2d(128, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up3): D_UpBlock(
      (conv): ConvBlock(
        (conv): Conv2d(128, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down3): D_DownBlock(
      (conv): ConvBlock(
        (conv): Conv2d(192, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up4): D_UpBlock(
      (conv): ConvBlock(
        (conv): Conv2d(192, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down4): D_DownBlock(
      (conv): ConvBlock(
        (conv): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up5): D_UpBlock(
      (conv): ConvBlock(
        (conv): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down5): D_DownBlock(
      (conv): ConvBlock(
        (conv): Conv2d(320, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up6): D_UpBlock(
      (conv): ConvBlock(
        (conv): Conv2d(320, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (down6): D_DownBlock(
      (conv): ConvBlock(
        (conv): Conv2d(384, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (down_conv1): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv2): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (down_conv3): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (up7): D_UpBlock(
      (conv): ConvBlock(
        (conv): Conv2d(384, 64, kernel_size=(1, 1), stride=(1, 1))
        (act): PReLU(num_parameters=1)
      )
      (up_conv1): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv2): ConvBlock(
        (conv): Conv2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
      (up_conv3): DeconvBlock(
        (deconv): ConvTranspose2d(64, 64, kernel_size=(12, 12), stride=(8, 8), padding=(2, 2))
        (act): PReLU(num_parameters=1)
      )
    )
    (output_conv): ConvBlock(
      (conv): Conv2d(448, 3, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
)
